import { ScoreConversionTable } from '@/types';

export const scoreConversionTable: ScoreConversionTable = {
  "영어": [
    {
      "점수": 50,
      "CEFR": "90~100 (C1)",
      "TOEIC": "945~990",
      "TOEFL": "95~120",
      "IELTS": "7.0"
    },
    {
      "점수": 40,
      "CEFR": "85~89 (B2)",
      "TOEIC": "900~944",
      "TOEFL": "88~94",
      "IELTS": "6.5"
    },
    {
      "점수": 30,
      "CEFR": "80~84 (B2)",
      "TOEIC": "850~899",
      "TOEFL": "81~87",
      "IELTS": "6.0"
    },
    {
      "점수": 20,
      "CEFR": "75~79 (B2)",
      "TOEIC": "785~849",
      "TOEFL": "72~80",
      "IELTS": "5.5"
    },
    {
      "점수": 10,
      "CEFR": "70~74 (B1)",
      "TOEIC": "750~784",
      "TOEFL": "65~71",
      "IELTS": "5.0"
    }
  ],
  "제2외국어": [
    {
      "점수": 30,
      "일본어(JLPT)": "N1 (146~180)",
      "중국어(HSK)": "6급",
      "프랑스어(DELF)": "C2",
      "독일어(ZD)": "C2",
      "러시아어(TORFL)": "3단계",
      "스페인어(DELE)": "C2"
    },
    {
      "점수": 25,
      "일본어(JLPT)": "N1 (90~145)",
      "중국어(HSK)": "5급",
      "프랑스어(DELF)": "C1",
      "독일어(ZD)": "C1",
      "러시아어(TORFL)": "2단계",
      "스페인어(DELE)": "C1"
    },
    {
      "점수": 20,
      "일본어(JLPT)": "N2 (146~180)",
      "중국어(HSK)": "4급",
      "프랑스어(DELF)": "B2",
      "독일어(ZD)": "B2",
      "러시아어(TORFL)": "1단계",
      "스페인어(DELE)": "B2"
    },
    {
      "점수": 15,
      "일본어(JLPT)": "N2 (90~145)",
      "중국어(HSK)": "3급",
      "프랑스어(DELF)": "B1",
      "독일어(ZD)": "B1",
      "러시아어(TORFL)": "기본",
      "스페인어(DELE)": "B1"
    },
    {
      "점수": 10,
      "일본어(JLPT)": "N3 (146~180)",
      "중국어(HSK)": "2급",
      "프랑스어(DELF)": "A2",
      "독일어(ZD)": "A2",
      "러시아어(TORFL)": "기초",
      "스페인어(DELE)": "A2"
    }
  ]
};